Revit 2026 API

# CommandMenuItemSetToolTip Method

---

Set toolTip of CommandMenuItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetToolTip(
	string toolTip
)
```
```vb
Public Sub SetToolTip (
	toolTip As String
)
```
```cpp
public:
void SetToolTip(
	String^ toolTip
)
```
```fsharp
member SetToolTip :
        toolTip : string -> unit
```

#### Parameters

toolTip String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CommandMenuItem Class

Autodesk.Revit.UI Namespace